let tmp = readLine()!
var str_tmp = tmp.map({ String($0) }) 
let cyrillic = ["А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"];
let latin = ["A", "B", "V", "G", "D", "Ye", "Yo", "Zh", "Z", "I", "J", "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "F", "X", "C", "Ch", "Sh", "Shch", "", "Y", "", "E", "Yu", "Ya", "a", "b", "v", "g", "d", "ye", "yo", "zh", "z", "i", "j", "k", "l", "m", "n", "o", "p", "r", "s", "t", "u", "f", "x", "c", "ch", "sh", "shch", "", "y", "", "e", "Yu", "ya"];
for i in 0..<str_tmp.count{
    for j in 0..<cyrillic.count{
        if str_tmp[i]==cyrillic[j]{
            str_tmp[i] = latin[j]
        }
    }
}


print(str_tmp.reduce("") { $0 + String($1) })
